# 1Q) Create a database called temp_db. Open a cursor to this newly created database & 2Q) In the database temp_db created in Q.No.1, create a table called emp with the attributes empno, ename, salary and deptno\

In [72]:
import sqlite3
def create_temp():
    con = sqlite3.connect("temp_db.db")
    cur = con.cursor()
    cur.execute(''' Create table emp (emp_no int,emp_Name Varchar(20), Dep_no Varchar(30), salary int)''')
    con.commit()
    con.close()

In [ ]:
create_temp()

# 3Q)In the emp table created in Q.No. 2, insert any five records.

In [74]:
def Insert_emp(a,b,c,d):
    con = sqlite3.connect("temp_db.db")
    cur = con.cursor()
    cur.execute(''' Insert into emp values(?,?,?,?)''',(a,b,c,d))
    con.commit()
    con.close()

In [75]:
Insert_emp(101,'Mahesh','10',30000)
Insert_emp(102,'Venkat','20',24000)
Insert_emp(103,'Ramesh','30',14000)
Insert_emp(104,'Sharat','40',16000)
Insert_emp(105,'Anuska','50',20000)

# 4Q)From the emp table, display all the records.

In [76]:
def Display_rec():
    con = sqlite3.connect("temp_db.db")
    cur = con.cursor()
    cur.execute('''Select * from emp''')
    rows = cur.fetchall()
    con.close()
    return rows

In [77]:
print('  E_no',' E_Name','  Dp_no',' Salary')
print('='*35,)
Display_rec()

  E_no  E_Name   Dp_no  Salary
===================================

[(101, 'Mahesh', '10', 30000),
 (102, 'Venkat', '20', 24000),
 (103, 'Ramesh', '30', 14000),
 (104, 'Sharat', '40', 16000),
 (105, 'Anuska', '50', 20000)]

# 5QFrom the emp table, display the records of only those employees whose salary is greater than 15000 and who belong to deptno 10

In [78]:
def Display_rec():
    con = sqlite3.connect("temp_db.db")
    cur = con.cursor()
    cur.execute('''Select * from emp where Salary > 15000''')
    rows = cur.fetchall()
    con.close()
    return rows

In [79]:
print('Emp Salary who is > 15000')
print('-'*35)
print('  E_no',' E_Name','  Dp_no',' Salary')
print('='*35,)
Display_rec()

Emp Salary who is > 15000
-----------------------------------
  E_no  E_Name   Dp_no  Salary
===================================

[(101, 'Mahesh', '10', 30000),
 (102, 'Venkat', '20', 24000),
 (104, 'Sharat', '40', 16000),
 (105, 'Anuska', '50', 20000)]

# 6QFrom the emp table, display the records of only those employees whose salary lies between 20000 and 25000 and who do not belong to the deptno 10

In [82]:
def Display_rec():
    con = sqlite3.connect("temp_db.db")
    cur = con.cursor()
    cur.execute('''Select * from emp where Salary BETWEEN 20000 AND 25000 AND dep_no !=10''')
    rows = cur.fetchall()
    con.close()
    return rows

In [83]:
print('Emp Salary who is < 25000')
print('-'*35)
print('  E_no',' E_Name','  Dp_no',' Salary')
print('='*35,)
Display_rec()

Emp Salary who is < 25000
-----------------------------------
  E_no  E_Name   Dp_no  Salary
===================================

[(102, 'Venkat', '20', 24000), (105, 'Anuska', '50', 20000)]

# 7Q)From the emp table, display the records of only those employees whose name begins with M.

In [84]:
def Display_rec():
    con = sqlite3.connect("temp_db.db")
    cur = con.cursor()
    cur.execute('''Select * from emp where emp_Name like  'M%' ''')
    rows = cur.fetchall()
    con.close()
    return rows

In [85]:
print('  E_no',' E_Name','  Dp_no',' Salary')
print('='*35,)
Display_rec()

  E_no  E_Name   Dp_no  Salary
===================================

[(101, 'Mahesh', '10', 30000)]

# 8Q)In the emp table, delete the records of those employees who belong to deptno 30

In [97]:
def delete():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('DELETE FROM emp where dep_no = 30')
    conn.commit()
    conn.close()

In [98]:
delete()

# 9Q)In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

In [93]:
def update(emp_no):
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute("UPDATE emp SET salary=salary+(salary*10/100) where emp_no=?",(emp_no,))
    conn.commit()
    conn.close()

In [94]:
update(101)

# 10Q)Delete the emp table.

In [70]:
def delete():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('DELETE FROM emp')
    conn.commit()
    conn.close()

In [71]:
delete()